Repository: yeager/swedish-tm
Catalog: reviewed/catalogs/gitlab.tmx
Source language: en
Languages: sv

source: AiPowered|Users with the Maintainer or Owner role for a project can include recommended domains, add more domains, and allow all Unix sockets.
sv: AI-funktioner|Användare med rollen Underhållare eller Ägare i ett projekt kan inkludera rekommenderade domäner, lägga till fler domäner och tillåta alla Unix-socketar.

source: AiPowered|Users with the Maintainer or Owner role for a project can use external agents.
sv: AI-funktioner|Användare med rollen Underhållare eller Ägare i ett projekt kan använda externa agenter.

source: AiPowered|View usage dashboard
sv: AI-funktioner|Visa användningspanel

source: AiPowered|When GitLab Duo is not available, experiment and beta features cannot be turned on.
sv: AI-funktioner|När GitLab Duo inte är tillgängligt kan experimentella funktioner och betafunktioner inte aktiveras.

source: AiPowered|When GitLab Duo is not available, prompt caching cannot be turned on.
sv: AI-funktioner|När GitLab Duo inte är tillgängligt kan promptcache inte aktiveras.

source: AiPowered|When you save, GitLab Duo will be turned off for all groups, subgroups, and projects.
sv: AI-funktioner|När du sparar stängs GitLab Duo av för alla grupper, undergrupper och projekt.

source: AiPowered|When you turn on this setting, GitLab stores new AI audit events to the database or ClickHouse. Real-time streaming of AI audit events is not affected.
sv: AI-funktioner|När du aktiverar den här inställningen lagrar GitLab nya AI-granskningshändelser i databasen eller ClickHouse. Strömning av AI-granskningshändelser i realtid påverkas inte.

source: AiPowered|registry.gitlab.com
sv: AI-funktioner|registry.gitlab.com

source: AlertManagement|There was an error while updating the assignees list. Please try again.
sv: Larmhantering|Ett fel uppstod när listan över tilldelade uppdaterades. Försök igen.

source: AlertManagement|There was an error while updating the assignees of the alert. Please try again.
sv: Larmhantering|Ett fel uppstod när larmets tilldelade uppdaterades. Försök igen.

source: AlertMappingBuilder|Title is a required field for alerts in GitLab. Should the payload field you specified not be available, specify which field we should use instead.
sv: Larmmappningsbyggare|Titel är ett obligatoriskt fält för larm i GitLab. Om nyttolastfältet du angav inte är tillgängligt anger du vilket fält som ska användas i stället.

source: AlertSettings|Active alerts
sv: Larminställningar|Aktiva larm

source: All LFS files must be unlocked.
sv: Alla LFS-filer måste låsas upp.

source: All child items must be confidential in order to turn on confidentiality.
sv: Alla underordnade objekt måste vara konfidentiella för att sekretess ska kunna aktiveras.

source: All child items will also be moved to the selected location.
sv: Alla underordnade objekt flyttas också till den valda platsen.

source: All external status checks must pass.
sv: Alla externa statuskontroller måste godkännas.

source: All instance runners with the '%{tag}' tag are paused. Unpause at least one to run foundational flows.
sv: Alla instansrunners med taggen ”%{tag}” är pausade. Återuppta minst en för att köra grundläggande flöden.

source: All merge requests that block this one must be merged.
sv: Alla sammanslagningsbegäranden som blockerar den här måste slås samman.

source: All open threads must be resolved.
sv: Alla öppna trådar måste lösas.

source: All paths must be unlocked
sv: Alla sökvägar måste låsas upp

source: All policy rules must be satisfied.
sv: Alla policyregler måste uppfyllas.

source: All requested changes must be resolved.
sv: Alla begärda ändringar måste lösas.

source: All required approvals given
sv: Alla obligatoriska godkännanden har getts

source: All required approvals must be given.
sv: Alla obligatoriska godkännanden måste ges.

source: All users with matching phone numbers
sv: Alla användare med matchande telefonnummer

source: All your to-do items are done.
sv: Alla dina att göra-objekt är klara.

source: Allow access to pipelines and job details, including output logs and artifacts, based on your project's visibility settings.
sv: Tillåt åtkomst till pipelines och jobbinformation, inklusive utdata från loggar och artefakter, enligt projektets synlighetsinställningar.

source: Allow embedding of external videos and designs in Markdown.
sv: Tillåt inbäddning av externa videor och designer i Markdown.

source: Allow group and project access tokens
sv: Tillåt åtkomsttoken för grupper och projekt

source: Allow job retries even if the deployment job is outdated.
sv: Tillåt omförsök av jobb även om driftsättningsjobbet är inaktuellt.

source: Allow job retries for rollback deployments
sv: Tillåt omförsök av jobb för återställningsdriftsättningar

source: Allow more restrictive 2FA enforcement for subgroups
sv: Tillåt striktare krav på tvåfaktorsautentisering för undergrupper

source: Allow the user to confirm their identity with only an email address, and skip phone number or credit card verification.
sv: Tillåt användaren att bekräfta sin identitet med endast en e-postadress och hoppa över verifiering med telefonnummer eller kreditkort.

source: Allow top-level group owners to create Service accounts.
sv: Tillåt ägare av grupper på toppnivå att skapa tjänstekonton.

source: Allow unauthenticated users to use search
sv: Tillåt oautentiserade användare att använda sökningen

source: Allow users to create organizations
sv: Tillåt användare att skapa organisationer

source: Allow users to extend their session
sv: Tillåt användare att förlänga sin session

source: Allow users to register any application to use GitLab as an OAuth provider. This setting does not affect group-level OAuth applications.
sv: Tillåt användare att registrera valfritt program för att använda GitLab som OAuth-leverantör. Inställningen påverkar inte OAuth-program på gruppnivå.

source: Allow users with up to Guest role to create groups and personal projects
sv: Tillåt användare med som högst rollen Gäst att skapa grupper och personliga projekt

source: Amazon Q successfully received the callback request from your GitLab instance.
sv: Amazon Q tog emot återanropsbegäran från GitLab-instansen.

source: AmazonQ|Active cloud connector token not found.
sv: Amazon Q|Ingen aktiv token för molnanslutning hittades.

source: AmazonQ|Amazon Q Configuration
sv: Amazon Q|Amazon Q-konfiguration

source: AmazonQ|Amazon Q Settings have been saved.
sv: Amazon Q|Amazon Q-inställningarna har sparats.

source: AmazonQ|Amazon Q will be turned off by default, but still be available to any groups or projects that have previously enabled it.
sv: Amazon Q|Amazon Q stängs av som standard men är fortfarande tillgängligt för grupper och projekt som tidigare har aktiverat det.

source: AmazonQ|Amazon Q will be turned off for all groups, subgroups, and projects, even if they have previously enabled it.
sv: Amazon Q|Amazon Q stängs av för alla grupper, undergrupper och projekt, även om de tidigare har aktiverat det.

source: AmazonQ|An unexpected error occurred while disconnecting Amazon Q. Please see the browser console log for more details.
sv: Amazon Q|Ett oväntat fel uppstod när Amazon Q kopplades från. Se webbläsarens konsollogg för mer information.

source: AmazonQ|An unexpected error occurred while submitting the form. Please see the browser console log for more details.
sv: Amazon Q|Ett oväntat fel uppstod när formuläret skickades. Se webbläsarens konsollogg för mer information.

source: AmazonQ|Apply changes to this merge request based on the comments
sv: Amazon Q|Tillämpa ändringar på sammanslagningsbegäran utifrån kommentarerna

source: AmazonQ|Are you sure? Removing the ARN will disconnect Amazon Q from GitLab and all related features will stop working.
sv: Amazon Q|Är du säker? Om du tar bort ARN kopplas Amazon Q från GitLab och alla relaterade funktioner slutar fungera.

source: AmazonQ|Cloud connector token could not be decoded
sv: Amazon Q|Token för molnanslutning kunde inte avkodas

source: AmazonQ|Configure GitLab Duo with Amazon Q
sv: Amazon Q|Konfigurera GitLab Duo med Amazon Q

source: AmazonQ|Create a merge request to incorporate Amazon Q suggestions
sv: Amazon Q|Skapa en sammanslagningsbegäran för att ta med Amazon Q-förslag

source: AmazonQ|Create an identity provider for this GitLab instance within AWS using the following values. %{helpStart}Learn more%{helpEnd}.
sv: AmazonQ|Skapa en identitetsleverantör för den här GitLab-instansen i AWS med följande värden. %{helpStart}Läs mer%{helpEnd}.

source: AmazonQ|Delete the IAM identity provider created for AI gateway.
sv: Amazon Q|Ta bort IAM-identitetsleverantören som skapats för AI Gateway.

source: AmazonQ|Delete the IAM role.
sv: Amazon Q|Ta bort IAM-rollen.

source: AmazonQ|Enter the IAM role's ARN.
sv: Amazon Q|Ange IAM-rollens ARN.

source: AmazonQ|Features are available. However, any group, subgroup, or project can turn them off.
sv: Amazon Q|Funktionerna är tillgängliga. En grupp, undergrupp eller ett projekt kan dock stänga av dem.

source: AmazonQ|Features are not available and cannot be turned on for any group, subgroup, or project.
sv: Amazon Q|Funktionerna är inte tillgängliga och kan inte aktiveras för någon grupp, undergrupp eller något projekt.

source: AmazonQ|Features are not available. However, any group, subgroup, or project can turn them on.
sv: Amazon Q|Funktionerna är inte tillgängliga. En grupp, undergrupp eller ett projekt kan dock aktivera dem.

source: AmazonQ|GitLab Duo with Amazon Q
sv: Amazon Q|GitLab Duo med Amazon Q

source: AmazonQ|GitLab Duo with Amazon Q has been successfully disconnected
sv: Amazon Q|GitLab Duo med Amazon Q har kopplats från

source: AmazonQ|GitLab Duo with Amazon Q is ready to go! 🎉
sv: Amazon Q|GitLab Duo med Amazon Q är redo att användas! 🎉

source: AmazonQ|Have Amazon Q review code in merge requests automatically
sv: Amazon Q|Låt Amazon Q granska kod automatiskt i sammanslagningsbegäranden

source: AmazonQ|I'm creating unit tests for the selected lines of code. I'll update this comment and this merge request when I'm done.
sv: Amazon Q|Jag skapar enhetstester för de valda kodraderna. Jag uppdaterar kommentaren och sammanslagningsbegäran när jag är klar.

source: AmazonQ|I'm creating unit tests for this merge request. I'll update this comment when I'm done.
sv: Amazon Q|Jag skapar enhetstester för sammanslagningsbegäran. Jag uppdaterar kommentaren när jag är klar.

source: AmazonQ|I'm generating code for this issue. I'll update this comment and open a merge request when I'm done.
sv: Amazon Q|Jag genererar kod för ärendet. Jag uppdaterar kommentaren och öppnar en sammanslagningsbegäran när jag är klar.

source: AmazonQ|I'm revising this merge request based on your feedback. I'll update this comment and this merge request when I'm done.
sv: Amazon Q|Jag ändrar sammanslagningsbegäran enligt din återkoppling. Jag uppdaterar kommentaren och sammanslagningsbegäran när jag är klar.

source: AmazonQ|I'm upgrading your code to Java 17. I'll update this comment and open a merge request when I'm done.
sv: Amazon Q|Jag uppgraderar koden till Java 17. Jag uppdaterar kommentaren och öppnar en sammanslagningsbegäran när jag är klar.

source: AmazonQ|IAM role's ARN
sv: AmazonQ|ARN för IAM-roll

source: AmazonQ|IAM role's ARN is not valid
sv: Amazon Q|IAM-rollens ARN är inte giltig

source: AmazonQ|IAM role's ARN is valid
sv: Amazon Q|IAM-rollens ARN är giltig

source: AmazonQ|If this is what you want, remove the IAM role's ARN. To completely remove GitLab Duo with Amazon Q, update the following in AWS:
sv: Amazon Q|Om det här är vad du vill tar du bort IAM-rollens ARN. Uppdatera följande i AWS för att ta bort GitLab Duo med Amazon Q helt:

source: AmazonQ|Provide feedback on code review
sv: Amazon Q|Ge återkoppling på kodgranskningen

source: AmazonQ|Provider type
sv: AmazonQ|Providertyp

source: AmazonQ|Remove IAM role's ARN
sv: Amazon Q|Ta bort IAM-rollens ARN

source: AmazonQ|Something went wrong retrieving the identity provider payload.
sv: Amazon Q|Något gick fel när identitetsleverantörens nyttolast hämtades.

source: AmazonQ|Something went wrong saving Amazon Q settings.
sv: Amazon Q|Något gick fel när Amazon Q-inställningarna sparades.

source: AmazonQ|Sorry, I'm not able to complete the request at this moment. Please try again later.
sv: Amazon Q|Jag kan tyvärr inte slutföra begäran just nu. Försök igen senare.

source: AmazonQ|This field is required
sv: Amazon Q|Det här fältet är obligatoriskt

source: AmazonQ|To completely remove GitLab Duo with Amazon Q, update the following in AWS:
sv: Amazon Q|Uppdatera följande i AWS för att ta bort GitLab Duo med Amazon Q helt:

source: AmazonQ|Upgrade Java Maven application to Java 17
sv: Amazon Q|Uppgradera Java Maven-program till Java 17

source: AmazonQ|Use GitLab Duo with Amazon Q to create and review merge requests and upgrade Java.
sv: Amazon Q|Använd GitLab Duo med Amazon Q för att skapa och granska sammanslagningsbegäranden och uppgradera Java.

source: AmazonQ|Use GitLab Duo with Amazon Q to create and review merge requests and upgrade Java. GitLab Duo with Amazon Q is separate from GitLab Duo Pro and Enterprise.
sv: Amazon Q|Använd GitLab Duo med Amazon Q för att skapa och granska sammanslagningsbegäranden och uppgradera Java. GitLab Duo med Amazon Q är separat från GitLab Duo Pro och Enterprise.

source: AmazonQ|View configuration setup
sv: Amazon Q|Visa konfigurationsinställning

source: AmazonQ|Within your AWS account, create an IAM role for Amazon Q and the relevant identity provider. %{helpStart}Learn how to create an IAM role%{helpEnd}.
sv: AmazonQ|Skapa en IAM-roll för Amazon Q och relevant identitetsleverantör i ditt AWS-konto. %{helpStart}Läs hur du skapar en IAM-roll%{helpEnd}.

source: AmazonQ|Your GitLab Duo with Amazon Q subscription has ended
sv: Amazon Q|Din prenumeration på GitLab Duo med Amazon Q har upphört

source: AmbiguousRef|Which reference do you want to view?
sv: Tvetydig referens|Vilken referens vill du visa?

source: AmbiguousRef|Which reference would you like to view?
sv: Tvetydig referens|Vilken referens vill du visa?

source: An administrator added this OAuth application
sv: En administratör lade till det här OAuth-programmet

source: An administrator added this OAuth application %{created_date} ago.
sv: En administratör lade till OAuth-programmet för %{created_date} sedan.

source: An administrator must enable the container registry for Auto DevOps to work.
sv: En administratör måste aktivera containerregistret för att Auto DevOps ska fungera.

source: An anonymous service added this dynamically created OAuth application
sv: En anonym tjänst lade till det här dynamiskt skapade OAuth-programmet

source: An anonymous service added this dynamically created OAuth application %{created_date} ago.
sv: En anonym tjänst lade till det här dynamiskt skapade OAuth-programmet för %{created_date} sedan.

source: An epic’s color is shown in roadmaps and epic boards.
sv: Ett episks färg visas i färdplaner och episktavlor.

source: An error occured when subscribing to the comment temperature updates. Please try again.
sv: Ett fel uppstod när prenumerationen på uppdateringar av kommentartemperatur skapades. Försök igen.

source: An error occured while parsing comment temperature. Please try again.
sv: Ett fel uppstod när kommentartemperaturen tolkades. Försök igen.

source: An error occurred creating the blob
sv: Ett fel uppstod när blobben skapades

source: An error occurred editing the blob
sv: Ett fel uppstod när blobben redigerades

source: An error occurred loading the group counts.
sv: Ett fel uppstod när antal grupper lästes in.

source: An error occurred loading the project counts.
sv: Ett fel uppstod när antal projekt lästes in.

source: An error occurred loading the tab counts.
sv: Ett fel uppstod när antal flikar lästes in.

source: An error occurred unarchiving this group. Please refresh the page to try again.
sv: Ett fel uppstod när gruppen skulle avarkiveras. Uppdatera sidan och försök igen.

source: An error occurred when trying to display this embedded view:
sv: Ett fel uppstod när den här inbäddade vyn skulle visas:

source: An error occurred while creating the group. Please try again.
sv: Ett fel uppstod när gruppen skapades. Försök igen.

source: An error occurred while creating the issue. Please try again.
sv: Ett fel uppstod när ärendet skapades. Försök igen.

source: An error occurred while discarding your review. Please try again.
sv: Ett fel uppstod när granskningen skulle förkastas. Försök igen.

source: An error occurred while editing lock information, please try again.
sv: Ett fel uppstod när låsinformationen redigerades. Försök igen.

source: An error occurred while fetching branches.
sv: Ett fel uppstod när grenar hämtades.

source: An error occurred while fetching lock information, please try again.
sv: Ett fel uppstod när låsinformationen hämtades. Försök igen.

source: An error occurred while fetching the job log. The information presented below may not be accurate. Refresh the page to retrieve the latest job log.
sv: Ett fel uppstod när jobbets logg hämtades. Informationen nedan kanske inte är korrekt. Uppdatera sidan för att hämta den senaste jobbloggen.

source: An error occurred while fetching the job. The information presented below may not be accurate. Refresh the page to retrieve the latest job log.
sv: Ett fel uppstod när jobbet hämtades. Informationen nedan kanske inte är korrekt. Uppdatera sidan för att hämta den senaste jobbloggen.

source: An error occurred while getting merge request counts
sv: Ett fel uppstod när antalet sammanslagningsbegäranden hämtades

source: An error occurred while getting work item user preference.
sv: Ett fel uppstod när användarinställningen för arbetsobjekt hämtades.

source: An error occurred while loading file controls. Refresh the page.
sv: Ett fel uppstod när filkontroller lästes in. Uppdatera sidan.

source: An error occurred while loading merge requests
sv: Ett fel uppstod när sammanslagningsbegäranden lästes in

source: An error occurred while removing tickets.
sv: Ett fel uppstod när biljetterna togs bort.

source: An error occurred while resetting the compute usage.
sv: Ett fel uppstod när beräkningsanvändningen återställdes.

source: An error occurred while saving the settings.
sv: Ett fel uppstod när inställningarna sparades.

source: An error occurred while subscribing to this page. Please try again later.
sv: Ett fel uppstod när sidan prenumererades på. Försök igen senare.

source: An error occurred while trying to render the rich text editor. Please try again.
sv: Ett fel uppstod när RTF-redigeraren återgavs. Försök igen.

source: An error occurred while trying to update the registries: '%{error_message}'.
sv: Ett fel uppstod när registren skulle uppdateras: ”%{error_message}”.

source: An error occurred while trying to update the registry: '%{error_message}'.
sv: Ett fel uppstod när registret skulle uppdateras: ”%{error_message}”.

source: An error occurred while unsubscribing from this page. Please try again later.
sv: Ett fel uppstod när prenumerationen på sidan avslutades. Försök igen senare.

source: An error occurred while updating your settings. Reload the page to try again.
sv: Ett fel uppstod när inställningarna uppdaterades. Ladda om sidan och försök igen.

source: An export is already running or queued for this project. Please try again once it's done.
sv: En export körs redan eller står i kö för det här projektet. Försök igen när den är klar.

source: An unexpected error occurred trying to submit your comment. Please try again.
sv: Ett oväntat fel uppstod när kommentaren skulle skickas. Försök igen.

source: An unexpected error occurred. Please try again.
sv: Ett oväntat fel uppstod. Försök igen.

source: AnalyticsDashboards|An error occurred when trying to display this panel
sv: AnalyticsDashboards|Ett fel uppstod när den här panelen skulle visas

source: AnalyticsDashboards|Failed to load dashboards list. Please try again.
sv: AnalyticsDashboards|Det gick inte att läsa in listan över instrumentpaneler. Försök igen.

source: AnalyticsDashboards|Failed to load namespace metadata.
sv: AnalyticsDashboards|Det gick inte att läsa in namnrymdsmetadata.

source: AnalyticsDashboards|Failed to update dashboard. Please try again.
sv: AnalyticsDashboards|Det gick inte att uppdatera instrumentpanelen. Försök igen.

source: Analytics|Failed to fetch data
sv: Analytics|Det gick inte att hämta data

source: Analytics|Failed to load dashboard
sv: Ett fel uppstod när blobben togs bort.

source: Analytics|Unable to update analytics settings. Please try again.
sv: Analytics|Det gick inte att uppdatera analysinställningarna. Försök igen.

source: Analytics|You have insufficient %{linkStart}permissions%{linkEnd} to view this panel.
sv: Analytics|Du saknar %{linkStart}behörighet%{linkEnd} att visa den här panelen.

source: Analyze your source code for vulnerabilities.
sv: Analysera källkoden efter sårbarheter.

source: AppleAppStore|Protected branches and tags only
sv: AppleAppStore|Endast skyddade grenar och taggar

source: AppleAppStore|Set variables on protected branches and tags only
sv: AppleAppStore|Ange endast variabler för skyddade grenar och taggar

source: AppleAppStore|Set variables on protected branches and tags only.
sv: AppleAppStore|Ange endast variabler för skyddade grenar och taggar.

source: ApplicationSettings|Any user that visits %{host} and creates an account must be explicitly approved by an administrator before they can sign in. Only effective if new user accounts are allowed.
sv: ApplicationSettings|Alla användare som besöker %{host} och skapar ett konto måste godkännas uttryckligen av en administratör innan de kan logga in. Gäller endast om nya användarkonton är tillåtna.

source: ApplicationSettings|Approve role promotions
sv: ApplicationSettings|Godkänn rollbefordringar

source: ApplicationSettings|Enable domain denylist for new users
sv: ApplicationSettings|Aktivera spärrlista över domäner för nya användare

source: ApplicationSettings|Require admin approval when a non-billable user is moving into a billable role.
sv: ApplicationSettings|Kräv administratörsgodkännande när en användare utan fakturering flyttas till en fakturerbar roll.

source: ApplicationSettings|Role Promotions
sv: ApplicationSettings|Rollbefordringar

source: ApplicationSettings|Send a confirmation email when a user creates an account. New users can sign in immediately, but must confirm their email address within three days.
sv: ApplicationSettings|Skicka ett bekräftelsemeddelande när en användare skapar ett konto. Nya användare kan logga in direkt, men måste bekräfta sin e-postadress inom tre dagar.

source: ApplicationSettings|Send a confirmation email when a user creates an account. New users must confirm their email address before they can sign in.
sv: ApplicationSettings|Skicka ett bekräftelsemeddelande när en användare skapar ett konto. Nya användare måste bekräfta sin e-postadress innan de kan logga in.

source: Apply filter globally to all notification events
sv: Tillämpa filtret globalt på alla aviseringshändelser

source: ApprovalRules|Define target branch approval rules for new merge requests.
sv: ApprovalRules|Definiera regler för godkännande av målgrenar för nya sammanfogningsbegäranden.

source: ApprovalSettings|This setting is enforced by a merge request approval policy.
sv: ApprovalSettings|Den här inställningen tillämpas av en policy för godkännande av sammanfogningsbegäran.

source: Archived labels are not available for use. Unarchive a label you want to use, or delete a label you want to permanently remove.
sv: Arkiverade etiketter kan inte användas. Återställ en etikett som du vill använda eller ta bort en etikett permanent.
